[Killed] BlockStatement
src/operacoes.js:17:22
   return Math.sqrt(n);
 }
 function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
-function fatorial(n) {
-  if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
-  let resultado = 1;
-  for (let i = 2; i <= n; i++) { resultado *= i; }
-  return resultado;
-}
+function fatorial(n) {}
 function mediaArray(numeros) {
   if (numeros.length === 0) return 0;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 7. deve retornar o resto da divisão
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:20:19
 function fatorial(n) {
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
   let resultado = 1;
-  for (let i = 2; i <= n; i++) { resultado *= i; }
+  for (let i = 2; false; i++) { resultado *= i; }
   return resultado;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 7. deve retornar o resto da divisão
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] EqualityOperator
src/operacoes.js:42:28
 }
 function valorAbsoluto(n) { return Math.abs(n); }
 function arredondar(n) { return Math.round(n); }
-function isPar(n) { return n % 2 === 0; }
+function isPar(n) { return n % 2 !== 0; }
 function isImpar(n) { return n % 2 !== 0; }
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 15. deve retornar true para um número par
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/operacoes.js:46:49
 function isImpar(n) { return n % 2 !== 0; }
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
 function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
-function diminuirPorcentagem(valor, percentual) { return valor * (1 - percentual / 100); }
+function diminuirPorcentagem(valor, percentual) {}
 function inverterSinal(n) { return -n; }
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 19. deve diminuir um valor em uma porcentagem
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: undefined

[Killed] ArithmeticOperator
src/operacoes.js:61:47
   return Math.sqrt(Math.pow(catetoA, 2) + Math.pow(catetoB, 2));
 }
 function grausParaRadianos(graus) { return graus * (Math.PI / 180); }
-function radianosParaGraus(radianos) { return radianos * (180 / Math.PI); }
+function radianosParaGraus(radianos) { return radianos / (180 / Math.PI); }
 
 // === Bloco 4: Teoria dos Números e Sequências (31-40) ===
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 30. deve converter radianos para graus
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 180
Received: 0.05483113556160754

Expected precision:    2
Expected difference: < 0.005
Received difference:   179.9451688644384

[Killed] BooleanLiteral
src/operacoes.js:72:22
   return (a * b) / mdc(a, b);
 }
 function isPrimo(n) {
-  if (n <= 1) return false;
+  if (n <= 1) return true;
   for (let i = 2; i < n; i++) {
     if (n % i === 0) return false;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 33. deve verificar que um número é primo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/operacoes.js:73:19
 }
 function isPrimo(n) {
   if (n <= 1) return false;
-  for (let i = 2; i < n; i++) {
+  for (let i = 2; i <= n; i++) {
     if (n % i === 0) return false;
   }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 33. deve verificar que um número é primo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/operacoes.js:79:7
   return true;
 }
 function fibonacci(n) { // Retorna o n-ésimo termo
-  if (n <= 1) return n;
+  if (n > 1) return n;
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 34. deve calcular o 10º termo de Fibonacci
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: 10

[Killed] BlockStatement
src/operacoes.js:82:32
   if (n <= 1) return n;
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
-function produtoArray(numeros) {
-  return numeros.reduce((acc, val) => acc * val, 1);
-}
+function produtoArray(numeros) {}
 function clamp(valor, min, max) {
   if (valor < min) return min;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:83:39
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
 function produtoArray(numeros) {
-  return numeros.reduce((acc, val) => acc * val, 1);
+  return numeros.reduce((acc, val) => acc / val, 1);
 }
 function clamp(valor, min, max) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 0.041666666666666664

[Killed] ArrowFunction
src/operacoes.js:83:25
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
 function produtoArray(numeros) {
-  return numeros.reduce((acc, val) => acc * val, 1);
+  return numeros.reduce(() => undefined, 1);
 }
 function clamp(valor, min, max) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:91:51
   return valor;
 }
 function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
-function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
+function celsiusParaFahrenheit(celsius) { return (celsius / 9/5) + 32; }
 function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) * 5/9; }
 function inverso(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 38. deve converter Celsius para Fahrenheit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 212
Received: 34.22222222222222
